Revit 2027 API
FabricationRodInfo.SetRodStructureExtension Method
 Set the length of the rod's top extension into structure. The rod must be attached to structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SetRodStructureExtension(
	int rodIndex,
	double extension
)
Public Function SetRodStructureExtension (
	rodIndex As Integer,
	extension As Double
) As Boolean
public:
bool SetRodStructureExtension(
	int rodIndex,
	double extension
)
member SetRodStructureExtension :
        rodIndex : int *
        extension : float -> bool
Parameters
rodIndex Int32
 The rod index.
extension Double
 Distance the rod will extend into the structure.
Return Value
Boolean
 Returns true if it was successful otherwise false.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
InvalidOperationException |  The rods do not attached to any structue.
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace